Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་ཤེས་པས་དུས་དང་ཚོད་དུ་རན་པར་སྤྱོད་ཅིང་ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པས་བསམ་པ་ཤིན་ཏུ་བརྒྱན་པས་བདག་དང་གཞན་གྱི་དོན་དུ་རབ་ཏུ་བརྩོན་པར་བྱེད་དེ།
en: He is adorned with a sense of shame and conscience and engages in benefiting himself and others.

source: དེའི་ཕྱིར་ངོ་ཚ་ཤེས་ཤིང་ཁྲེལ་ཡོད་པ་ཡིན། སྦྱོར་བ་དེ་དག་ལའང་འབྱུང་བར་སྤྱོད་པ་ཡིན།
en: That being so, he has a sense of shame and conscience and engages in that kind of conduct.

source: ཕྱིར་མི་ཟློགས་ཤིང་ཕྱིར་མི་ལྡོག་པའི་བརྩོན་འགྲུས་དང་སྟོབས་ཀྱི་ཤུགས་ཀྱང་རབ་ཏུ་ཐོབ་པ་ཡིན་ཏེ། དེ་ལྟར་དེའི་དགའ་བའི་སྟོབས་དང་ཤུགས་ཡོངས་སུ་སྐྱེས་པ་ཡིན། དགའ་བའི་སྟོབས་དང་ཤུགས་རབ་ཏུ་ཐོབ་པས་དེ་བཞིན་གཤེགས་པ་མཆོད་ཅིང་རིམ་གྲོ་བྱ་བ་ལ་རབ་ཏུ་བརྩོན་ཞིང་བསྟན་པ་ལ་འང་ནན་ཏན་ཤིན་ཏུ་བྱེད་དོ།
en: He is unaffected by worldly concerns, will not turn away from enlightenment, and therefore gains the power of stability. Having acquired the power of stability he applies himself to serving and making offerings to the tathāgatas and is dedicated to their teachings.

source: །དེ་ལྟར་དེའི་ས་ཡོངས་སུ་སྦྱོང་བའི་ཆོས་འདི་ལྟ་སྟེ།
en: “In that way these are the qualities of that purified bhūmi:

source: དད་པ་དང་སྙིང་རྗེ་དང་། བྱམས་པ་དང་། གཏོང་བ་དང་། སྐྱོ་བ་མེད་པ་དང་། གཙུག་ལག་ཤེས་པ་དང་། འཇིག་རྟེན་ཤེས་པ་དང་། ཁྲེལ་ཡོད་ཅིང་ངོ་ཚ་ཤེས་པ་དང་། དགའ་བའི་སྟོབས་ཀྱི་ཤུགས་དང་། དེ་བཞིན་གཤེགས་པ་མཆོད་ཅིང་རིམ་གྲོར་བྱ་བའི་ནན་ཏན་ཡོངས་སུ་སྐྱེས་པ་ཡིན་ནོ།
en: (1) faith, ( ) compassion, (3) love, (4) generosity, (5) indefatigability, (6) knowledge of the teaching, (7) knowledge of the world, (8) a sense of shame and conscience, (9) the power of stability, and (10) serving and making offerings to the tathāgatas.

source: །དེ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ས་རབ་ཏུ་དགའ་བ་འདི་ལ་གནས་པའི་ཚེ་ལྟ་བ་རྒྱ་ཆེན་པོ་དང་། སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་སངས་རྒྱས་མང་པོ་རབ་ཏུ་སྣང་བར་འགྱུར་ཏེ།
en: “When in that way he is on the Perfect Joy bodhisattva bhūmi, because of his vast view and the power of his prayers many buddhas will appear to him.

source: ལྟ་བ་རྒྱ་ཆེན་པོ་དང་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་སངས་རྒྱས་བརྒྱ་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་ཁྲག་ཁྲིག་སྟོང་ཕྲག་མང་པོ་དང་སངས་རྒྱས་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་རབ་ཏུ་སྣང་བར་འགྱུར་རོ།
en: Because of his vast view and the power of his prayers many hundreds of buddhas, many thousands of buddhas, many hundreds of thousands of buddhas, many millions of buddhas, many tens of millions of buddhas, many billions of buddhas, many tens of billions of buddhas, many trillions of buddhas, and many quintillions of buddhas will appear to him.

source: །དེས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་མཐོང་ནས་བསམ་པ་རྒྱ་ཆེན་པོས་རིམ་གྲོ་བྱེད་དོ། །བཀུར་སྟི་བྱེད་དོ། བསྟི་སྟང་བྱེད་དོ། །མཆོད་པ་བྱེད་དོ། །ན་བཟའ་དང་བསོད་སྙོམས་དང་། གཟིམས་ཅ་དང་སྙུན་གྱི་རྐྱེན་སྨན་དང་། ཡོ་བྱད་དག་ཀྱང་འབུལ་ཞིང་།
en: He will see those tathāgatas, those arhats, those samyak­sambuddhas, and with a vast motivation he will serve them, worship them, honor them, make offerings to them, supply them with robes, alms, bowls, beds, medicine for when they are ill, and implements.

source: བྱང་ཆུབ་སེམས་དཔའི་བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་འབུལ་ལོ།
en: He will also offer all the articles that bring happiness to a bodhisattva.

source: །དགེ་འདུན་གྱི་ཚོགས་རྣམས་ལ་འང་ཡང་དག་པར་མཆོད་པར་བྱེད་དེ།
en: He will also offer to the assemblies of the Saṅgha.

source: དགེ་བའི་རྩ་བ་དེ་དག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ།
en: He will dedicate all those roots of goodness to the highest complete enlightenment.

source: །དེ་ལྟར་དེས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་མཆོད་པས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་མངོན་པར་འགྲུབ་པ་ཡིན།
en: “In that way, he will make offerings to those bhagavats and will thereby accomplish the activity of ripening beings.

source: དེ་བསྡུ་བའི་དངོས་པོ་སྦྱིན་པ་དང་། ངག་སྙན་པ་གཉིས་ཀྱི་ཤས་ཆེ་བས་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ།
en: Through the methods for gathering pupils, generosity and pleasant words in particular, he will ripen beings.

source: །དེའི་མོས་པའི་སྟོབས་དང་ཤུགས་ཀྱིས་བསྡུ་བའི་དངོས་པོ་གོང་མ་གཉིས་ཀྱང་ཡོངས་སུ་འགྲུབ་པར་འགྱུར་ཏེ། མ་ལུས་པར་ཁོང་དུ་ཆུད་པར་ནི་མ་ཡིན་ནོ།
en: Through the strength of the power of his aspiration, he will also accomplish the two higher methods of gathering pupils, but he does not have the comprehension of everything without exception.

source: །དེའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཅུ་ལས་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཤས་ཆེ་བ་ཡིན་ཏེ། ལྷག་མ་རྣམས་ཀྱང་ཅི་ཚུལ་ཅི་ནུས་སུ་ཡང་དག་པར་མི་བསྒྲུབ་པ་མ་ཡིན་ནོ།
en: From among the ten perfections, the perfection of generosity predominates, and the other perfections are not accomplished fully and completely.

source: །དེ་ཇི་ལྟ་ཇི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མཆོད་པ་བྱེད་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་བརྩོན་པ་དང་། ས་ཡོངས་སུ་སྦྱོང་བའི་ཆོས་འདི་དག་ཡང་དག་པར་བླངས་ཏེ་གནས་པ་དེ་ལྟ་དེ་ལྟར་དེའི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པ་དེ་དག་དེ་བས་ཀྱང་ཤས་ཆེར་ཤིན་ཏུ་བྱང་བ་དང་། ཡོངས་སུ་དག་པ་དང་ལས་སུ་རུང་བར་འགྱུར་རོ།
en: “As he engages in making offerings to the buddha bhagavats and engages in ripening beings, he acquires the qualities of the purified bhūmi. Those roots of goodness, dedicated to omniscience, become even more purified and effective just as he wishes them to be.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །འདི་ལྟ་སྟེ་དཔེར་ན།
en: “O jinaputras!

source: མགར་བ་མཁས་པས་གསེར་གྱི་ས་ལེ་སྦྲམ། ཇི་ལྟ་ཇི་ལྟར་མྱེར་བསྲེགས་པ་དེ་ལྟ་དེ་ལྟར་ཤིན་ཏུ་བྱང་ཞིང་ཡོངས་སུ་དག་པ་དང་། ཅི་དགར་ལས་སུ་རུང་བར་འགྱུར་རོ།
en: By analogy, a skilled smith refines gold in fire so that it becomes purified and useful just as he wishes it to be.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཇི་ལྟ་ཇི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་མཆོད་པ་བྱེད་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་ལ་བརྩོན་པར་བྱེད་པ་དང་། ས་ཡོངས་སུ་སྦྱོང་བའི་ཆོས་ཀྱི་རྣམ་པ་འདི་ལྟ་བུ་དག་ཡང་དག་པར་བླངས་ཏེ་གནས་པ་དེ་ལྟ་དེ་ལྟར་དེའི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོས་པ་དེ་དག་ཤིན་ཏུ་བྱང་བ་དང་། ཡོངས་སུ་དག་པ་དང་། ཅི་དགར་ལས་སུ་རུང་བར་འགྱུར་རོ།
en: “O jinaputras! In the same way, as the bodhisattva engages in making offerings to the buddha bhagavats and engages in ripening beings, he acquires the qualities of the purified bhūmi. Those roots of goodness, dedicated to omniscience, become even more purified and effective just as he wishes them to be.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །གཞན་ཡང་ས་དང་པོ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་དེ་ཉིད་ཀྱི་རྣམ་པ་དང་། འཐོབ་པར་བྱ་བ་དང་། རྒྱུ་མཐུན་པའི་འབྲས་བུ་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་དགེ་བའི་བཤེས་གཉེན་ལས་ཡོངས་སུ་བཙལ་ཞིང་ཡོངས་སུ་དྲི་བར་བྱའོ།
en: “O jinaputras! Moreover, the bodhisattva mahāsattva who is on the first bodhisattva bhūmi investigates and questions the buddhas, bodhisattvas, and kalyāṇamitras about the features, attainments, and results of the first bodhisattva bhūmi.

source: །སའི་ཡན་ལག་ཡོངས་སུ་བསྒྲུབ་པའི་ཕྱིར་ཡང་ངོམས་མྱི་ཤེས་པར་བྱས་ཏེ།
en: He is never content in perfecting the aspects of that bhūmi.

source: དེས་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་འདི་ལ་གནས་པའི་ཚེ། བྱང་ཆུབ་སེམས་པས་ས་གཉིས་པ་དང་། གསུམ་པ་དང་། བཞི་པ་དང་། ལྔ་པ་དང་། དྲུག་པ་དང་། བདུན་པ་དང་། བརྒྱད་པ་དང་། དགུ་པ་དང་། བཅུ་པའི་རྣམ་པ་དང་། ཐོབ་པར་བྱ་བ་དང་། རྒྱུ་མཐུན་པའི་འབྲས་བུ་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། དགེ་བའི་བཤེས་གཉེན་ལས་ཡོངས་སུ་བཙལ་ཞིང་ཡོངས་སུ་དྲི་བར་བྱའོ། །སའི་ཡན་ལག་ཡོངས་སུ་བསྒྲུབ་པའི་ཕྱིར་ཡང་ངོམས་མི་ཤེས་པར་བྱའོ།
en: In the same way, he investigates and questions the buddhas, bodhisattvas, and kalyāṇamitras about the features, attainments, and results of the second, third, fourth, fifth, sixth, seventh, eighth, ninth, and tenth bodhisattva bhūmis, and he is never content with accomplishing the various aspects of these ten.

source: །དེས་སའི་ཕྱོགས་དང་མི་མཐུན་པའི་ཕྱོགས་ལ་མཁས་པར་བྱའོ།
en: “He becomes learned about what accords with and what is contrary to the bhūmis.

source: །ས་འགྲུབ་པ་དང་འཇིག་པ་ལ་མཁས་པར་བྱའོ།
en: He becomes learned about what develops and what counters the bhūmis.

source: །སའི་རྣམ་པ་དང་། རྒྱུ་མཐུན་པའི་འབྲས་བུ་ལ་མཁས་པར་བྱའོ།
en: He becomes learned about the features and consequences of the bhūmis. He becomes learned about the attainments and meditations of the bhūmis. He becomes learned about the refinement of the resultant features of the bhūmis.

source: །ས་འཐོབ་པར་བྱ་བ་དང་རྣམ་པར་བསྒོམ་པ་ལ་མཁས་པར་བྱའོ།
en: He becomes learned about the attainment and cultivation of the bhūmis.

source: །སའི་རྣམ་པ་ཡོངས་སུ་སྦྱང་བ་ལ་མཁས་པར་བྱའོ།
en: He becomes learned about purifying the features of the bhūmis.

source: །ས་ནས་སར་འཕར་བ་ལ་མཁས་པར་བྱའོ།
en: He becomes learned about ascending from one bhūmi to another.

source: །ས་དང་ས་ལ་རྣམ་པར་གནས་པ་ལ་མཁས་པར་བྱའོ།
en: He becomes learned about being on the various bhūmis.

source: །ས་ནས་སའི་གནས་གཞན་དུ་འཕོ་བར་བྱ་བ་ལ་མཁས་པར་བྱའོ།
en: He becomes learned about passing from one bhūmi to another.

source: །ས་ནས་སར་ཡོངས་སུ་སྦྱང་བའི་ཁྱད་པར་གྱི་ཡེ་ཤེས་ལ་མཁས་པར་བྱའོ།
en: He becomes learned about the differences between the bhūmis.

source: །ས་ནས་ས་ཐོབ་ནས་ཕྱིར་མི་ལྡོག་པའི་ཡེ་ཤེས་ལ་མཁས་པར་བྱའོ།
en: He becomes learned about knowing the irreversibility of the attainment of the bhūmis.

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་སྦྱང་བས་དེ་བཞིན་གཤེགས་པའི་ས་གནན་པ་ལ་མཁས་པར་བྱའོ།
en: He becomes learned about ascending to the tathāgata bhūmi through refining the bodhisattva bhūmis.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སའི་རྣམ་པ་མངོན་པར་བསྒྲུབ་པ་ལ་མཁས་པ་ནི་ས་དང་པོ་ལས་གྱེན་དུ་མ་བསྐྱོད་པར་ས་བཅུའི་བར་དུ་གནན་ཅིང་ཐོབ་པར་བྱ་བ་ཐོགས་པ་མྱེད་དེ།
en: “O jinaputras! In that way the bodhisattva mahāsattva who is learned in the accomplishment of the features of the bhūmis ascends without disturbance from the first bhūmi and reaches the tenth bhūmi without impediment.

source: ཐོགས་པ་མྱེད་པར་འགྲོ་བ་དང་། སའི་ཡེ་ཤེས་སྣང་བས་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་སྣང་བ་འང་རབ་ཏུ་ཐོབ་བོ།
en: Through the light of the wisdom of the bhūmis he attains the light of the wisdom of buddhahood.

source: དེད་དཔོན་ཆེན་པོ་མཁས་པས་ལམ་གྲོགས་ཡོངས་སུ་གདོན་པའི་བསམ་པ་དང་ལྡན་པ། གྲོང་རྡལ་ཆེན་པོའི་སར་ཕྱིན་པར་བྱ་བར།
en: By analogy, a wise great caravan leader wishes to lead the travelers and wants to bring them to a great city.

source: འདོད་པ་ནི་ཐོག་མ་ནས་ལམ་དང་ལམ་གྱི་ཡོན་ཏན་དང་། ལམ་ལས་གོལ་བའི་ཉེས་པ་དང་ལམ་གྱི་བར་མལ་གྱི་ཁྱད་པར་དང་། ལམ་གྱི་བར་མལ་འཁྲུལ་ན་ཉེས་པར་འགྱུར་བ་དང་། ལམ་དུ་བྱ་མི་བྱ་དང་། བརྒྱགས་བཤམས་པ་ཡོངས་སུ་ཚོལ་ཞིང་ཀུན་ཏུ་འདྲིའོ།
en: First he inquires and finds out about the good qualities of the route, the dangers of straying from the route, the differences between the stations along the route, the dangers of not knowing the stations along the route, what should and should not be done on the journey, and what provisions should be prepared.

source: །ཐོག་མའི་ལམ་གྱི་བར་མལ་ནས་མ་འཕགས་པ་ནས་གྲོང་རྡལ་དུ་ཕྱིན་གྱི་བར་དུ་ཤིན་ཏུ་མཁས་པ་ཡིན།
en: He learns well all about the first station of the journey and so on, up to arriving at the city.

source: ལམ་གྱི་བར་མ་ལ་དེ་ནས་མ་འཕགས་པར་དེ་ཉིད་ནས་ཤེས་པས་ཤིན་ཏུ་བརྟགས་པའི་བློ་དང་བརྒྱགས་ཀྱི་ཚོགས་ཆེན་པོ་ཕུན་སུམ་ཚོགས་པས་ལམ་གྲོགས་མང་པོ་རྣམས་ཉམ་ཉེས་མྱེད་པར་གྲོང་རྡལ་ཆེན་པོ་དེར་ཕྱིན་པར་བྱེད་དེ།
en: Before leaving the first station of the journey, he has examined and learned all this and has a vast accumulation of provisions, so that the numerous travelers will reach the great city without harm.

source: མྱ་ངམ་དང་དགོན་པའི་ཉེས་པས་བདག་དང་ལམ་གྲོགས་རྣམས་ལ་གནོད་པར་མི་འགྱུར་བར་བྱེད་དོ།
en: In that way he ensures that no harm will come to himself or his travelers in the deserts and uninhabited lands.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེད་དཔོན་མཁས་པ་ཡང་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་ལ་གནས་ཤིང་སའི་ཕྱོགས་དང་མི་མཐུན་པའི་ཕྱོགས་ལ་མཁས་པ་དང་། ས་འགྲུབ་པ་དང་འཇིག་པ་ལ་མཁས་པ་དང་། སའི་རྣམ་པ་དང་རྒྱུ་མཐུན་པའི་འབྲས་བུ་ལ་མཁས་པ་དང་། ས་འཐོབ་པར་བྱ་བ་དང་། རྣམ་པར་བསྒོམ་པ་ལ་མཁས་པ་དང་། སའི་ཡན་ལག་ཡོངས་སུ་སྦྱང་བ་ལ་མཁས་པ་དང་། ས་ནས་སར་འཕར་བ་ལ་མཁས་པ་དང་། ས་ནས་སར་རྣམ་པར་གནས་པ་ལ་མཁས་པ་དང་། ས་ནས་སར་ཁྱད་པར་དུ་འགྱུར་བའི་ཡེ་ཤེས་ལ་མཁས་པ་དང་། ས་ནས་ས་ཐོབ་པ་ལས་ཕྱིར་མི་ལྡོག་པ་ལ་མཁས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་ཡོངས་སུ་སྦྱང་བས་དེ་བཞིན་གཤེགས་པའི་ས་གནོན་པ་ལ་མཁས་པར་གྱུར་པ་དེའི་ཚེ།
en: “O jinaputras! In the same way, the bodhisattva mahāsattva is like a wise caravan leader. When he is on the first bodhisattva bhūmi he becomes learned about what accords with and what is contrary to the bhūmis. He becomes learned about what develops and what counters the bhūmis. He becomes learned about the features and results of the bhūmis. He becomes learned about the attainments and meditations of the bhūmis. He becomes learned about the refinement of the resultant features of the bhūmis. He becomes learned about the attainment and cultivation of the bhūmis. He becomes learned about purifying the features of the bhūmis. He becomes learned about ascending from one bhūmi to another. He becomes learned about being on the various bhūmis. He becomes learned about passing from one bhūmi to another. He becomes learned about the differences between the bhūmis.

source: བསོད་ནམས་ཀྱི་ཚོགས་ཆེན་པོའི་བརྒྱགས་ཡོངས་སུ་གཟུང་བ་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་ཆེན་པོ་ལ་རྣམ་པར་དབྱེ་བ་ཤིན་ཏུ་བྱས་པ་དང་། སེམས་ཅན་གྱི་ལམ་གྲོགས་མང་པོ་ཡོངས་སུ་གདོན་པའི་བསམ་པ་དང་ལྡན་པས་ཐམས་ཅད་མཁྱེན་པའི་གྲོང་རྡལ་ཆེན་པོར་ཕྱིན་པར་བྱ་བར་འདོད་ཅིང་ཐོག་མ་ནས་སའི་ལམ་དང་། སའི་ལམ་གྱི་ཡོན་ཏན་དང་། སའི་ལམ་གོལ་བའི་ཉེས་པ་དང་། སའི་ལམ་གྱི་བར་མལ་གྱི་ཁྱད་པར་དང་། སའི་ལམ་གྱི་བར་མལ་འཁྲུལ་ན་ཉེས་པར་འགྱུར་བ་དང་། བསོད་ནམས་ཀྱི་ཚོགས་ཆེན་པོའི་བརྒྱགས་བཤམས་ཤིང་བསྩོགས་པ་དག་ཀྱང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དག་དང་། དགེ་བའི་བཤེས་གཉེན་དག་ལས་ཡོངས་སུ་ཚོལ་ཤིང་ཡོངས་སུ་འདྲི་སྟེ།
en: He becomes learned about knowing the irreversibility of the attainment of the bhūmis. He becomes learned about ascending to the tathāgata bhūmi through refining the bodhisattva bhūmis. “At that time, he obtains the provisions of a great accumulation of merit and has the thorough examination of a great accumulation of wisdom. He has the motivation to lead the beings who are traveling this route and wishes to bring them to the great city of omniscience. “At the beginning, he questions and finds out from buddhas, bodhisattvas, and kalyāṇamitras about the path through the bhūmis, the qualities of the path through the bhūmis, the dangers of straying from the path through the bhūmis, the differences between the stations along the path through the bhūmis, and the dangers of not knowing the stations along the path through the bhūmis, and he prepares a great accumulation of merit as provisions.

source: དེ་ལམ་གྱི་བར་མལ་དང་པོ་ནས་གྱེན་དུ་མ་འཕགས་པར་ཐམས་ཅད་མཁྱེན་པའི་གྲོང་རྡལ་ཆེན་པོར་ཕྱིན་པར་བྱ་བའི་བར་དུ་མཁས་པ་ཡིན།
en: “He learns well everything from the first station of the path up to arriving at the city of omniscience.

source: དེ་དེ་ལྟར་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་རྟོག་པའི་བློ་དང་། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཆེན་པོའི་བརྒྱགས་ཕུན་སུམ་ཚོགས་པས་སེམས་ཅན་གྱི་ལམ་གྲོགས་ཀྱི་ཚོགས་ཆེན་པོ་ཡོངས་སུ་སྨྱིན་པའི་ཚུལ་བཞིན་དུ་འཁོར་བའི་མྱ་ངམ་དང་དགོན་པ་བརྒལ་དཀའ་བ་ལས་བསྒྲལ་ཏེ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་གྲོང་རྡལ་ཆེན་པོའི་བར་ཕྱིན་པར་བྱེད་ཅིང་འཁོར་བའི་མྱ་ངན་དང་དགོན་པའི་ཉེས་པས་སེམས་ཅན་ལམ་གྲོགས་སམ་བདག་ལ་གནོད་པར་ཡང་མི་འགྱུར་བར་བྱེད་དོ།
en: He has the intelligence of the discrimination of wisdom and the perfect provisions of a vast accumulation of merit and wisdom, so that by ripening a great multitude of beings he will accomplish the difficult journey of crossing the deserts and empty lands of saṃsāra and arrive at the great city of omniscience, and he ensures for himself and the others on the route that there will be no harm from the dangers of saṃsāra’s deserts and empty lands. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཡོངས་སུ་སྐྱོ་བ་མེད་པའི་ཡིད་ཀྱིས་ས་ཡོངས་སུ་སྦྱང་བའི་ཁྱད་པར་ལ་བརྩོན་པར་བྱའོ།
en: Therefore, the bodhisattva mahāsattva is indefatigable in his preparation for the different bhūmis.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་ཀྱིས་གནན་པའི་བར་དུ་ཡང་མཁས་པར་བྱའོ།
en: He becomes learned about them all, up to reaching the bhūmi of the wisdom of all the tathāgatas.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་རབ་ཏུ་དགའ་བའི་སྒོར་འཇུག་པ་མདོར་བསྡུས་ཏེ་བསྟན་པའོ།
en: “O jinaputras! That is the brief teaching on entering through the doorway of Perfect Joy, the first bodhisattva bhūmi of the bodhisattva mahāsattvas.

source: །རྒྱ་ཆེར་ནི་ཤིན་ཏུ་བསྟན་པ་བརྒྱ་སྟོང་གྲངས་མྱེད་པ་ལ་རྣམ་པའི་མུར་ཐུག་པ་མྱེད་པ་སྟེ།
en: “If I were to teach it in detail, I would not come to an end in countless hundreds of thousands of eons.

source: བསྐལ་པ་གྲངས་མྱེད་པའི་མཐར་ཐུག་པར་ཤིན་ཏུ་བསྟན་པའི་ཚུལ་གྱིས་ཁོང་དུ་ཆུད་པར་བྱའོ།
en: The teaching would not be fully completed until the end of an asaṃkhyeya eon.

source: །དེ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕལ་ཆེར་འཛམ་བུའི་གླིང་གི་རྒྱལ་པོར་འགྱུར་ཏེ།
en: “The bodhisattva mahāsattva on that bhūmi predominantly becomes a ruler of Jambudvīpa;

source: སྲིད་ཆེན་པོ་ལ་དབང་སྒྱུར་བ་རབ་ཏུ་ཐོབ་ཅིང་ཆོས་ཀྱིས་ཡོངས་སུ་བསྐྱང་བ་དང་། སེམས་ཅན་རྣམས་སྦྱིན་པ་ཆེན་པོས་ཡོངས་སུ་བསྡུ་བ་ལ་མཁས་ཤིང་མཐུ་ཡོད་པ་ཡིན། སེམས་ཅན་རྣམས་ཀྱི་འཇུངས་པའི་དྲི་མ་བཟློག་པ་ལ་མཁས་པ་ཡིན། སྦྱིན་པ་ཆེན་པོ་རྩོམ་པས་ཡོངས་སུ་དུབ་པར་མི་འགྱུར་བ་ཡིན། དེ་སྦྱིན་པ་འམ་ངག་སྙན་པ་འམ། དོན་བསྒྲུབ་པ་འམ།
en: he attains the state of sovereignty with great power and becomes a protector of the Dharma, becomes wise and powerful in the methods of attracting beings through great generosity, becomes wise in dispelling from beings the stain of avarice, and does not become disheartened in accomplishing great generosity;

source: དོན་མཐུན་པས་དགེ་བའི་རྩ་བ་གང་ཅི་རྩོམ་ཡང་རུང་སྟེ། དེ་ཐམས་ཅད་ཇི་ལྟར་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོག་ཏུ་འགྱུར། གཙོ་བོར་འགྱུར། ཐུ་བོར་འགྱུར། ཕུལ་དུ་འགྱུར། དམ་པར་འགྱུར།
en: and in whatever roots of goodness he practices through generosity, kind words, actions that benefit others, and practicing what he preaches, among all beings he becomes supreme, the best, the foremost, the highest, the most excellent, the unsurpassable, the guide, the leader, the commander, and so on, up until becoming the omniscient one who is relied on.

source: བླ་ན་མེད་པར་འགྱུར། འདྲེན་པར་འགྱུར། རྣམ་པར་འདྲེན་པར་འགྱུར། ཡོངས་སུ་འདྲེན་པར་འགྱུར་བ་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་རྟེན་པའི་བར་དུ་འགྱུར་སྙམ་སྟེ། སངས་རྒྱས་ཡིད་ལ་བྱ་བ་དང་། ཆོས་ཡིད་ལ་བྱ་བ་དང་། དགེ་འདུན་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡིད་ལ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ཡིད་ལ་བྱ་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིད་ལ་བྱ་བ་དང་། སྟོབས་ཡིད་ལ་བྱ་བ་དང་། མི་འཇིགས་པ་ཡིད་ལ་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཡིད་ལ་བྱ་བ་ནས། རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་བར་དུ་ཡིད་ལ་བྱ་བ་དང་མི་འབྲལ་བ་ཡིན།
en: “His mind is always focused on the Buddha, focused on the Dharma, focused on the Saṅgha, focused on the bodhisattvas, focused on bodhisattva conduct, focused on the bodhisattva bhūmis, focused on the perfections, focused on the strengths, focused on the confidences, focused on the unique qualities of buddhahood, and so on, up until being focused on the omniscient wisdom endowed with the supreme aspects.

source: དེ་འདོད་ན་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ། ཁྱིམ་དང་ཆུང་མ་དང་སྲིད་ཐམས་ཅད་ཡོངས་སུ་སྤངས་ཏེ།
en: “If he wishes to, he can apply himself in such a way that in just one instant, in one moment, he can give up his entire family, wife, and possessions and be ordained in the Tathāgata’s teaching.

source: དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་བ་དང་། རབ་ཏུ་བྱུང་ནས་ཀྱང་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་ཏིང་ངེ་འཛིན་བརྒྱ་རབ་ཏུ་འཐོབ་ཅིང་སྙོམས་པར་འཇུག་པ་དང་། སངས་རྒྱས་བརྒྱ་མཐོང་བ་དང་། དེ་དག་གིས་བྱིན་གྱི་རླབས་ཀྱང་ཡང་དག་པར་ཤེས་པ་དང་། འཇིག་རྟེན་ཁམས་བརྒྱ་སྐྱོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱར་འགྲོ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་སྣང་བར་བྱ་བ་དང་། སེམས་ཅན་བརྒྱ་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། བསྐལ་པ་བརྒྱར་གནས་པར་བྱ་བ་དང་། སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའི་བསྐལ་པ་བརྒྱ་ལ་རབ་ཏུ་འཇུག་པ་དང་། ཆོས་ཀྱི་སྒོ་བརྒྱ་རྣམ་པར་འབྱེད་པ་དང་། ལུས་བརྒྱ་ཡངས་སུ་བསྟན་པ་དང་། ལུས་རེ་རེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་བརྒྱ་ཡང་དག་པར་བསྟན་པར་བྱ་བའི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པ་དེ་ལྟ་བུ་རྩོམ་མོ།
en: Having been ordained, in just one instant he will attain and rest in a hundred samādhis, see a hundred buddhas and know their blessings, cause a hundred worlds to shake, go to a hundred buddha realms, illuminate a hundred worlds, ripen a hundred beings, remain for a hundred eons, enter a hundred previous eons and a hundred future eons, open a hundred Dharma doors, manifest a hundred bodies, and manifest each body having a retinue of a hundred bodhisattvas.

source: །དེ་ཡན་ཅད་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་མཐུ་ཅན་རྣམས་སྨོན་ལམ་གྱི་ཁྱད་པར་གྱིས་རྣམ་པར་འཕྲུལ་ཏེ་དེ་དག་གིས་ལུས་སམ་འོད་དང་རྫུ་འཕྲུལ་ལམ་མྱིག་གམ་སྤྱོད་ཡུལ་ལམ། དབྱངས་སམ་སྤྱོད་པ་འམ་རྒྱན་ཏམ་བྱིན་གྱི་རླབས་སམ་མོས་པ་འམ། མངོན་པར་འདུ་བྱེད་པ་དག་ཀྱང་བསྐལ་པ་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་ཕྲག་དུ་མ་དང་། བསྐལ་པ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མས་ཀྱང་བགྲང་བར་དཀའོ།
en: “From this time onward the bodhisattvas who have the power of prayer can through particular prayers manifest bodies, light, miracles, sights, activities, voices, conduct, displays, blessings, transformations, and manifestations for many eons, for hundreds of eons, for thousands of eons, for hundreds of thousands of eons, and for a quintillion eons.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས་སའི་དོན་འདི་ཉིད་ཡང་བརྟག་པར་བྱ་བ་དང་བསྟན་པར་བྱ་བའི་ཕྱིར་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: Then the bodhisattva Vajra­garbha, in order to examine and teach the meaning of this bhūmi, recited these verses:

source: །དེ་དག་དཀར་པོའི་ཆོས་བསྩགས་དགེ་བ་མཐུན་ལྡན་ཞིང་།
en: “They have accumulated good qualities, are endowed with goodness,

source: །བདེ་གཤེགས་ཡོངས་སུ་བསྙེན་བཀུར་སྙིང་རྗེ་བྱམས་ལྡན་ལ།
en: Have served the sugatas, are loving, kind, and helpful,

source: །དད་པ་རྒྱ་ཆེ་དགེ་སེམས་ངང་ཚུལ་དག་ལྡན་པ།
en: Have a vast motivation, have the pure nature of good intentions,

source: །རྒྱལ་བའི་ཡེ་ཤེས་དོན་དུ་རླབས་ཆེན་སེམས་ཀྱང་བསྐྱེད།
en: And develop an unequaled aspiration for the wisdom of the jinas. “They are diligent in purifying the strengths of the buddhas and omniscience

source: །རྒྱལ་བའི་ཆོས་རྫོགས་འགྲོ་བ་ཡོངས་སུ་བསྐྱབ་དོན་དུ། །ཐམས་ཅད་མཁྱེན་པ་སངས་རྒྱས་སྟོབས་སྦྱོང་བརྟན་མཐུ་ཅན།
en: In order to fulfill the Dharma of the jinas and protect beings.

source: །བརྩེ་བ་ཆེན་པོས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བྱ་བས།
en: With great kindness they develop the sublime aspiration

source: །རྒྱལ་བའི་ཞིང་སྦྱོང་སེམས་ཀྱི་དམ་པ་རབ་ཏུ་བསྐྱེད།
en: To purify buddha realms and turn the wheel of the Dharma. “In one instant they have nonconceptual knowledge of the three times

source: །འགྲོ་བར་རྣམ་པ་སྣ་ཚོགས་དུས་རྣམས་བསྟན་པའི་ཕྱིར།
en: So that there is the timely purification of various beings.

source: །འདྲེན་པ་ཀུན་གྱི་ཡོན་ཏན་ཐམས་ཅད་འདོད་ཚོལ་ཞིང་། །དུས་གསུམ་སྐད་ཅིག་གཅིག་ཏུ་མི་རྟོག་ཤེས་བྱེད་པའི།
en: In brief, they desire all the qualities of the guides

source: །མཁའ་འདྲ་ཤིན་ཏུ་ཡངས་པའི་སེམས་དང་ལྡན་པར་བྱེད།
en: And develop a vast aspiration equal to space.

source: །ཤེས་རབ་དབང་སྒྱུར་སྙིང་རྗེ་སྔུན་འགྲོ་ཐབས་ལྡན་ཞིང་།
en: “They have the power of wisdom, all-preceding compassion, and the employment of method.

source: །མོས་དང་བསམ་པ་རྣམ་དག་སྟོབས་ཀྱིས་ཚད་མྱེད་ལ།
en: They have pure motivation and intention, and immeasurable strengths;

source: །ཆགས་མྱེད་མངོན་གྱུར་གཞན་གྱི་དྲིང་ལ་མྱི་འཇོག་པ།
en: They have unimpeded manifestations to others who are to be guided.

source: །བདེ་གཤེགས་རྣམས་དང་མཉམ་གྱུར་སེམས་ཀྱི་དམ་པ་བསྐྱེད།
en: They have become the same as the sugatas and have developed the supreme motivation.

source: །བདེ་གཤེགས་སྲས་སེམས་རིན་ཆེན་ཡང་དག་སྐྱེས་འཕྲལ་དུ།
en: “Simultaneous with the precious motivation of the sons of the tathāgatas,

source: །བྱིས་པའི་སྤྱོད་བྲལ་སངས་རྒྱས་རྣམས་ཀྱི་སྤྱོད་དང་ལྡན།
en: They transcend the conduct of childlike beings and gain the conduct of the buddhas.

source: །སྟོབས་བཅུ་མངའ་རིགས་ཁ་ན་མ་ཐོ་མེད་པར་སྐྱེས།
en: They are born into the family of the ten strengths and do not commit infractions;

source: །བདེ་གཤེགས་མཉམ་ཉིད་རྗེས་རྟོགས་བྱང་ཆུབ་མཆོག་ཏུ་ངེས།
en: They have become the same as the jinas and will definitely have the highest enlightenment.
